Revit 2026 API

# ElectricalSystemLoadName Property

---

The LoadName of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string LoadName { get; set; }
```
```vb
Public Property LoadName As String
	Get
	Set
```
```cpp
public:
property String^ LoadName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member LoadName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This property is used to retrieve the LoadName of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace